In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),index=pd.Index(['LA','SF'],name='city'),
                   columns=pd.Index(['A','B','C','D'],name='letter'))

dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [3]:
dframe_st = dframe1.stack()

In [4]:
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [5]:
dframe1.unstack()

letter  city
A       LA      0
        SF      4
B       LA      1
        SF      5
C       LA      2
        SF      6
D       LA      3
        SF      7
dtype: int32

In [9]:
dframe1.unstack('letter')

letter  city
A       LA      0
        SF      4
B       LA      1
        SF      5
C       LA      2
        SF      6
D       LA      3
        SF      7
dtype: int32

In [10]:
ser1 = Series([0,1,2],index=['Q','X','Y'])

ser2 = Series([4,5,6],index=['X','Y','Z'])

In [11]:
dframe = pd.concat([ser1,ser2],keys=['Alpha','Beta'])
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [12]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [15]:
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

---

In [ ]:
Duplicates

In [31]:
dframe = DataFrame({'key1':['A']*2+['B']*3,
                   'key2':[2,2,2,3,3]})

In [32]:
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [33]:
dframe.duplicated() #tells if rowds are duplicates

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [34]:
dframe.drop_duplicates() #dropping duplicates

  key1  key2
0    A     2
2    B     2
3    B     3

In [35]:
dframe.drop_duplicates(['key1']) #drop duplicates from specific columns

  key1  key2
0    A     2
2    B     2

In [38]:
dframe.drop_duplicates(['key1'],keep ='first')

  key1  key2
0    A     2
2    B     2

---

In [ ]:
#Mapping

In [39]:
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                   'altitude':[3158,3000,2762]})

dframe

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2762

In [40]:
state_map = {'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

In [41]:
dframe['state'] = dframe['city'].map(state_map)

In [42]:
dframe

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming